IRP/src/Documents/BatchReallocateOutgoing/BatchReallocateOutgoing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BatchReallocateOutgoing</name>
  <registerRecords>InformationRegister.T6020S_BatchKeysInfo</registerRecords>
  <registerRecords>AccumulationRegister.R6060T_CostOfGoodsSold</registerRecords>
  <registerRecords>AccumulationRegister.R4050B_StockInventory</registerRecords>
  <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
  <registerRecords>AccumulationRegister.R6020B_BatchBalance</registerRecords>
  <registerRecords>AccumulationRegister.R6025B_BatchV2</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Document</name>
    <type>
      <types>DocumentRef.PurchaseInvoice</types>
      <types>DocumentRef.PurchaseReturn</types>
      <types>DocumentRef.Unbundling</types>
      <types>DocumentRef.OpeningEntry</types>
      <types>DocumentRef.RetailReturnReceipt</types>
      <types>DocumentRef.SalesReturn</types>
      <types>DocumentRef.StockAdjustmentAsSurplus</types>
      <types>DocumentRef.StockAdjustmentAsWriteOff</types>
      <types>DocumentRef.Bundling</types>
      <types>DocumentRef.RetailSalesReceipt</types>
      <types>DocumentRef.ItemStockAdjustment</types>
      <types>DocumentRef.InventoryTransfer</types>
      <types>DocumentRef.SalesInvoice</types>
    </type>
  </attributes>
  <attributes>
    <name>BatchReallocate</name>
    <type>
      <types>DocumentRef.CalculationMovementCosts</types>
    </type>
  </attributes>
  <attributes>
    <name>Incoming</name>
    <type>
      <types>DocumentRef.BatchReallocateIncoming</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemList</name>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Store</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>Branch</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Enums/BatchDirection/BatchDirection.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>BatchDirection</name>
 <enumValues>
  <name>Receipt</name>
 </enumValues>
 <enumValues>
  <name>Expense</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/BatchReallocateOutgoing/ManagerModule.bsl
#Region POSTING

Function PostingGetDocumentDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = New Structure();
	QueryArray = GetQueryTextsSecondaryTables();
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
	Return Tables;
EndFunction

Function PostingGetLockDataSource(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map();
	Return DataMapWithLockFields;
EndFunction

Procedure PostingCheckBeforeWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = Parameters.DocumentDataTables;
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.SetRegisters(Tables, Ref);	
	PostingServer.FillPostingTables(Tables, Ref, QueryArray, Parameters);
EndProcedure

Function PostingGetPostingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	PostingDataTables = New Map();
	PostingServer.SetPostingDataTables(PostingDataTables, Parameters);
	Return PostingDataTables;
EndFunction

Procedure PostingCheckAfterWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

#EndRegion

#Region UNDOPOSTING

Function UndopostingGetDocumentDataTables(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

Function UndopostingGetLockDataSource(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

Procedure UndopostingCheckBeforeWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

Procedure UndopostingCheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

#EndRegion

Function GetInformationAboutMovements(Ref) Export
	Str = New Structure();
	Str.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	Str.Insert("QueryTextsMasterTables", GetQueryTextsMasterTables());
	Str.Insert("QueryTextsSecondaryTables", GetQueryTextsSecondaryTables());
	Return Str;
EndFunction

Function GetAdditionalQueryParameters(Ref)
	StrParams = New Structure();
	StrParams.Insert("Ref", Ref);
	Return StrParams;
EndFunction

Function GetQueryTextsSecondaryTables()
	QueryArray = New Array();
	QueryArray.Add(ItemList());
	Return QueryArray;
EndFunction

Function GetQueryTextsMasterTables()
	QueryArray = New Array();
	QueryArray.Add(R4050B_StockInventory());
	QueryArray.Add(T6020S_BatchKeysInfo());
	Return QueryArray;
EndFunction

Function ItemList()
	Return
	"SELECT
	|	ItemList.Ref,
	|	ItemList.Ref.Date AS Period,
	|	ItemList.Ref.Company,
	|	ItemList.ItemKey,
	|	ItemList.Store,
	|	SUM(ItemList.Quantity) AS Quantity
	|INTO ItemList
	|FROM
	|	Document.BatchReallocateOutgoing.ItemList AS ItemList
	|WHERE
	|	ItemList.Ref = &Ref
	|GROUP BY
	|	ItemList.Ref.Date,
	|	ItemList.Ref.Company,
	|	ItemList.ItemKey,
	|	ItemList.Store,
	|	ItemList.Ref";
EndFunction

Function R4050B_StockInventory()
	Return 
	"SELECT
	|	VALUE(AccumulationRecordType.Expense) AS RecordType,
	|	ItemList.Period,
	|	ItemList.Company,
	|	ItemList.Store,
	|	ItemList.ItemKey,
	|	SUM(ItemList.Quantity) AS Quantity
	|INTO R4050B_StockInventory
	|FROM
	|	ItemList AS ItemList
	|WHERE
	|	TRUE
	|GROUP BY
	|	VALUE(AccumulationRecordType.Receipt),
	|	ItemList.Period,
	|	ItemList.Company,
	|	ItemList.Store,
	|	ItemList.ItemKey,
	|	VALUE(AccumulationRecordType.Expense)";
EndFunction

Function T6020S_BatchKeysInfo()
	Return
	"SELECT
	|	ItemList.ItemKey,
	|	ItemList.Store,
	|	ItemList.Company,
	|	SUM(ItemList.Quantity) AS Quantity,
	|	ItemList.Period,
	|	VALUE(Enum.BatchDirection.Expense) AS Direction
	|INTO T6020S_BatchKeysInfo
	|FROM
	|	ItemList AS ItemList
	|WHERE
	|	TRUE
	|GROUP BY
	|	ItemList.ItemKey,
	|	ItemList.Store,
	|	ItemList.Company,
	|	ItemList.Period,
	|	VALUE(Enum.BatchDirection.Expense)";
EndFunction
